#ifndef AK_ATOMIC_H
#define AK_ATOMIC_H

/*Platform detection macros*/
#if defined(_MSC_VER)
	#define AK_ATOMIC_OS_WIN32
	#define AK_ATOMIC_COMPILER_MSVC
	
	#if defined(_M_X64)
		#define AK_ATOMIC_PTR_SIZE 8
	#elif defined(_M_IX86)
		#define AK_ATOMIC_PTR_SIZE 4
	#else
		#error "Unrecognized Platform!"
	#endif
#elif defined(__GNUC__)
	#define AK_ATOMIC_COMPILER_GCC
	#define AK_ATOMIC_OS_POSIX

	#if defined(__APPLE__)
		#define AK_ATOMIC_OS_OSX
	#endif

	#if defined(__arm__)
		#define AK_ATOMIC_CPU_ARM
		#define AK_ATOMIC_PTR_SIZE 4
	#elif defined(__aarch64__)
		#define AK_ATOMIC_CPU_AARCH64
		#define AK_ATOMIC_PTR_SIZE 8
	#elif defined(__x86_64__)
		#define AK_ATOMIC_CPU_X86
		#define AK_ATOMIC_PTR_SIZE 8   
	#elif defined(__i386__)
		#define AK_ATOMIC_CPU_X86
		#define AK_ATOMIC_PTR_SIZE 4    
	#else
		#error "Not Implemented"
	#endif
#else
	#error "Unrecognized Platform!"
#endif

#if defined(__clang__)
	#define AK_ATOMIC_COMPILER_CLANG
#endif

/*If we are using c11 or c++11 (or greater) we wrap the atomic api's to get
  compiler intrinsics which should (in theory) have the best performance*/

#if __STDC_VERSION__ > 199901L && !defined(AK_ATOMIC_NO_C11_STD)
	#define AK_ATOMIC_C11
#endif

#if __cplusplus > 199711L && !defined(AK_ATOMIC_NO_CPP11_STD)
	#define AK_ATOMIC_CPP11
#endif

#ifdef AK_ATOMIC_C11
#include <stdatomic.h>
#endif

#ifdef AK_ATOMIC_CPP11
#include <atomic>
#endif

#ifndef AK_ATOMIC_EXCLUDE_STDINT
/*In Ansi MSVC, stdint.h includes comments that have single line comments which breaks ansi c standard.
  Need to disable this warning for MSVC only
*/
#ifdef AK_ATOMIC_COMPILER_MSVC
#pragma warning(push)
#pragma warning(disable : 4001)
#endif

#include <stdint.h>

#ifdef AK_ATOMIC_COMPILER_MSVC
#pragma warning(pop)
#endif

#endif

#define AK_ATOMIC__STATIC_ASSERT(COND,MSG) typedef char static_assertion_##MSG[(!!(COND))*2-1]
#define AK_ATOMIC__COMPILE_TIME_ASSERT3(X,L) AK_ATOMIC__STATIC_ASSERT(X,static_assertion_at_line_##L)
#define AK_ATOMIC__COMPILE_TIME_ASSERT2(X,L) AK_ATOMIC__COMPILE_TIME_ASSERT3(X,L)
#define AK_ATOMIC__COMPILE_TIME_ASSERT(X)    AK_ATOMIC__COMPILE_TIME_ASSERT2(X,__LINE__)

/*Verify datatypes are correct byte sizes*/
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(uint8_t)  == 1);
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(uint16_t) == 2);
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(uint32_t) == 4);
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(uint64_t) == 8);

AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(int8_t)  == 1);
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(int16_t) == 2);
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(int32_t) == 4);
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(int64_t) == 8);

#ifdef __cplusplus
#define AK_ATOMIC_EXTERN_C extern "C"
#else
#define AK_ATOMIC_EXTERN_C extern
#endif

#ifndef AKATOMICDEF
#ifdef AK_ATOMIC_STATIC
#define AKATOMICDEF static
#else
#define AKATOMICDEF AK_ATOMIC_EXTERN_C
#endif
#endif

#if defined(AK_ATOMIC_C11)
typedef struct {
	atomic_uchar Internal;
} ak_atomic_u8;

typedef struct {
	atomic_ushort Internal;
} ak_atomic_u16;

typedef struct {
	atomic_uint Internal;
} ak_atomic_u32;

typedef struct {
	atomic_ullong Internal;
} ak_atomic_u64;

typedef struct {
	atomic_size_t Internal;
} ak_atomic_ptr;

#define AK_Atomic_Fence_Acquire() atomic_thread_fence(memory_order_acquire)
#define AK_Atomic_Fence_Release() atomic_thread_fence(memory_order_release)
#define AK_Atomic_Fence_Seq_Cst() atomic_thread_fence(memory_order_seq_cst)

#elif defined(AK_ATOMIC_CPP11)
typedef struct {
	std::atomic_uchar Internal;
} ak_atomic_u8;

typedef struct {
	std::atomic_ushort Internal;
} ak_atomic_u16;

typedef struct {
	std::atomic_uint Internal;
} ak_atomic_u32;

typedef struct {
	std::atomic_ullong Internal;
} ak_atomic_u64;

typedef struct {
	std::atomic_size_t Internal;
} ak_atomic_ptr;

#define AK_Atomic_Fence_Acquire() atomic_thread_fence(std::memory_order_acquire)
#define AK_Atomic_Fence_Release() atomic_thread_fence(std::memory_order_release)
#define AK_Atomic_Fence_Seq_Cst() atomic_thread_fence(std::memory_order_seq_cst)

#elif defined(AK_ATOMIC_COMPILER_MSVC)

#elif defined(AK_ATOMIC_COMPILER_GCC) && (defined(AK_ATOMIC_CPU_AARCH64) || defined(AK_ATOMIC_CPU_ARM))

typedef struct {
	uint8_t Nonatomic;
} ak_atomic_u8;

typedef struct {
	uint16_t Nonatomic;
} __attribute__((aligned(2))) ak_atomic_u16;

typedef struct {
	uint32_t Nonatomic;
} __attribute__((aligned(4))) ak_atomic_u32;

typedef struct {
	uint64_t Nonatomic;
} __attribute__((aligned(8))) ak_atomic_u64;

typedef struct {
	void* Nonatomic;
} __attribute__((aligned(AK_ATOMIC_PTR_SIZE))) ak_atomic_ptr;

#if AK_ATOMIC_ARM_VERSION >= 7
#define AK_Atomic_Fence_Acquire() __asm__ volatile("dmb ish" ::: "memory")
#define AK_Atomic_Fence_Release() __asm__ volatile("dmb ish" ::: "memory")
#define AK_Atomic_Fence_Seq_Cst() __asm__ volatile("dmb ish" ::: "memory")
#else
#define AK_Atomic_Fence_Acquire() __asm__ volatile("mcr p15, 0, %0, c7, c10, 5" :: "r"(0) : "memory")
#define AK_Atomic_Fence_Release() __asm__ volatile("mcr p15, 0, %0, c7, c10, 5" :: "r"(0) : "memory")
#define AK_Atomic_Fence_Seq_Cst() __asm__ volatile("mcr p15, 0, %0, c7, c10, 5" :: "r"(0) : "memory")
#endif

#elif defined(AK_ATOMIC_COMPILER_GCC) && defined(AK_ATOMIC_CPU_X86)

typedef struct {
	volatile uint8_t Nonatomic;
} ak_atomic_u8;

typedef struct {
	volatile uint16_t Nonatomic;
} __attribute__((aligned(2))) ak_atomic_u16;

typedef struct {
	volatile uint32_t Nonatomic;
} __attribute__((aligned(4))) ak_atomic_u32;

typedef struct {
	volatile uint64_t Nonatomic;
} __attribute__((aligned(8))) ak_atomic_u64;

typedef struct {
	volatile void* Nonatomic;
} __attribute__((aligned(AK_ATOMIC_PTR_SIZE))) ak_atomic_ptr;

#define AK_Atomic_Fence_Acquire() __asm__ volatile("" ::: "memory")
#define AK_Atomic_Fence_Release() __asm__ volatile("" ::: "memory")

#if AK_ATOMIC_PTR_SIZE == 8
#define AK_Atomic_Fence_Seq_Cst() __asm__ volatile("lock; orl $0, (%%rsp)" ::: "memory")
#else
#define AK_Atomic_Fence_Seq_Cst() __asm__ volatile("lock; orl $0, (%%esp)" ::: "memory")
#endif

#else
#error "Not Implemented!"
#endif

AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(ak_atomic_u8)  == 1);
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(ak_atomic_u16) == 2);
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(ak_atomic_u32) == 4);
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(ak_atomic_u64) == 8);
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(ak_atomic_ptr) == AK_ATOMIC_PTR_SIZE);

typedef enum {
    AK_ATOMIC_MEMORY_ORDER_RELAXED,
    AK_ATOMIC_MEMORY_ORDER_ACQUIRE,
    AK_ATOMIC_MEMORY_ORDER_RELEASE,
    AK_ATOMIC_MEMORY_ORDER_ACQ_REL,
	AK_ATOMIC_MEMORY_ORDER_SEQ_CST
} ak_atomic_memory_order;

/*Atomic functions with memory order parameters*/
AKATOMICDEF uint8_t AK_Atomic_Load_U8(const ak_atomic_u8* Object, ak_atomic_memory_order MemoryOrder);
AKATOMICDEF void    AK_Atomic_Store_U8(ak_atomic_u8* Object, uint8_t Value, ak_atomic_memory_order MemoryOrder);
AKATOMICDEF uint8_t AK_Atomic_Exchange_U8(ak_atomic_u8* Object, uint8_t NewValue, ak_atomic_memory_order MemoryOrder);
AKATOMICDEF uint8_t AK_Atomic_Compare_Exchange_Strong_U8(ak_atomic_u8* Object, uint8_t OldValue, uint8_t NewValue, ak_atomic_memory_order MemoryOrder);
