#ifndef AK_ATOMIC_H
#define AK_ATOMIC_H

/*Platform detection macros*/
#if defined(_MSC_VER)
	#define AK_ATOMIC_OS_WIN32
	#define AK_ATOMIC_COMPILER_MSVC
	
	#if defined(_M_X64)
		#define AK_ATOMIC_PTR_SIZE 8
	#elif defined(_M_IX86)
		#define AK_ATOMIC_PTR_SIZE 4
	#else
		#error "Unrecognized Platform!"
	#endif
#else
	#error "Unrecognized Platform!"
#endif

#ifndef AK_ATOMIC_EXCLUDE_STDINT
/*In Ansi MSVC, stdint.h includes comments that have single line comments which breaks ansi c standard.
  Need to disable this warning for MSVC only
*/
#ifdef AK_ATOMIC_COMPILER_MSVC
#pragma warning(push)
#pragma warning(disable : 4001)
#endif

#include <stdint.h>

#ifdef AK_ATOMIC_COMPILER_MSVC
#pragma warning(pop)
#endif

#endif

#define AK_ATOMIC__STATIC_ASSERT(COND,MSG) typedef char static_assertion_##MSG[(!!(COND))*2-1]
#define AK_ATOMIC__COMPILE_TIME_ASSERT3(X,L) AK_ATOMIC__STATIC_ASSERT(X,static_assertion_at_line_##L)
#define AK_ATOMIC__COMPILE_TIME_ASSERT2(X,L) AK_ATOMIC__COMPILE_TIME_ASSERT3(X,L)
#define AK_ATOMIC__COMPILE_TIME_ASSERT(X)    AK_ATOMIC__COMPILE_TIME_ASSERT2(X,__LINE__)

/*Verify datatypes are correct byte sizes*/
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(uint8_t)  == 1);
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(uint16_t) == 2);
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(uint32_t) == 4);
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(uint64_t) == 8);

AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(int8_t)  == 1);
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(int16_t) == 2);
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(int32_t) == 4);
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(int64_t) == 8);

#ifdef __cplusplus
#define AK_ATOMIC_EXTERN_C extern "C"
#else
#define AK_ATOMIC_EXTERN_C extern
#endif

#ifndef AKATOMICDEF
#ifdef AK_ATOMIC_STATIC
#define AKATOMICDEF static
#else
#define AKATOMICDEF AK_ATOMIC_EXTERN_C
#endif
#endif

#if defined(AK_ATOMIC_COMPILER_MSVC)

/*Warnings for intrin.h*/
#pragma warning(push, 0)
#include <intrin.h>
#pragma warning(pop)

typedef struct {
	uint8_t Nonatomic;
} ak_atomic_u8;

typedef struct {
	uint16_t Nonatomic;
} ak_atomic_u16;

typedef struct {
	uint32_t Nonatomic;
} ak_atomic_u32;

typedef struct {
	uint64_t Nonatomic;
} ak_atomic_u64;

typedef struct {
	void* Nonatomic;
} ak_atomic_ptr;

#define AK_Atomic_Fence_Acquire() _ReadBarrier()
#define AK_Atomic_Fence_Release() _WriteBarrier()
#define AK_Atomic_Fence_Seq_Cst() _ReadWriteBarrier(); MemoryBarrier()

#else
#error "Not Implemented!"
#endif

AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(ak_atomic_u8)  == 1);
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(ak_atomic_u16) == 2);
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(ak_atomic_u32) == 4);
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(ak_atomic_u64) == 8);
AK_ATOMIC__COMPILE_TIME_ASSERT(sizeof(ak_atomic_ptr) == AK_ATOMIC_PTR_SIZE);

/*Compiler specific functions (all other atomics are built ontop of these)*/
AKATOMICDEF uint8_t AK_Atomic_Load_U8_Relaxed(const ak_atomic_u8* Object);
AKATOMICDEF void    AK_Atomic_Store_U8_Relaxed(ak_atomic_u8* Object, uint8_t Value);
AKATOMICDEF uint8_t AK_Atomic_Exchange_U8_Relaxed(ak_atomic_u8* Object, uint8_t Value);
AKATOMICDEF uint8_t AK_Atomic_Compare_Exchange_U8_Relaxed(ak_atomic_u8* Object, uint8_t OldValue, uint8_t NewValue);
AKATOMICDEF int8_t  AK_Atomic_Compare_Exchange_U8_Weak_Relaxed(ak_atomic_u8* Object, uint8_t* OldValue, uint8_t NewValue);
AKATOMICDEF uint8_t AK_Atomic_Fetch_Add_U8_Relaxed(ak_atomic_u8* Object, int8_t Operand);
AKATOMICDEF uint8_t AK_Atomic_Increment_U8_Relaxed(ak_atomic_u8* Object);
AKATOMICDEF uint8_t AK_Atomic_Decrement_U8_Relaxed(ak_atomic_u8* Object); 

AKATOMICDEF uint16_t AK_Atomic_Load_U16_Relaxed(const ak_atomic_u16* Object);
