#ifndef AK_FBX_H
#define AK_FBX_H


#pragma warning(push)
#pragma warning(disable : 4820)

#ifdef __cplusplus
extern "C" {
#endif

#ifndef AKFBXDEF
# ifdef AK_FBX_STATIC
# define AKFBXDEF static
# else
# define AKFBXDEF extern
# endif
#endif

#ifndef AK_FBX_NO_STDIO
#include <stdio.h>
#endif

#define AK_FBX__STATIC_ASSERT(COND,MSG) typedef char static_assertion_##MSG[(!!(COND))*2-1]
// token pasting madness:
#define AK_FBX__COMPILE_TIME_ASSERT3(X,L) AK_FBX__STATIC_ASSERT(X,static_assertion_at_line_##L)
#define AK_FBX__COMPILE_TIME_ASSERT2(X,L) AK_FBX__COMPILE_TIME_ASSERT3(X,L)
#define AK_FBX__COMPILE_TIME_ASSERT(X)    AK_FBX__COMPILE_TIME_ASSERT2(X,__LINE__)

#ifndef AK_FBX_CUSTOM_TYPES
typedef char ak_fbx_s8;
typedef short ak_fbx_s16;
typedef int ak_fbx_s32;
typedef long long ak_fbx_s64;
typedef unsigned char ak_fbx_u8;
typedef unsigned short ak_fbx_u16;
typedef unsigned int ak_fbx_u32;
typedef unsigned long long ak_fbx_u64;
#endif

AK_FBX__COMPILE_TIME_ASSERT(sizeof(ak_fbx_s8) == 1);
AK_FBX__COMPILE_TIME_ASSERT(sizeof(ak_fbx_u8) == 1);
AK_FBX__COMPILE_TIME_ASSERT(sizeof(ak_fbx_s16) == 2);
AK_FBX__COMPILE_TIME_ASSERT(sizeof(ak_fbx_u16) == 2);
AK_FBX__COMPILE_TIME_ASSERT(sizeof(ak_fbx_s32) == 4);
AK_FBX__COMPILE_TIME_ASSERT(sizeof(ak_fbx_u32) == 4);
AK_FBX__COMPILE_TIME_ASSERT(sizeof(ak_fbx_s64) == 8);
AK_FBX__COMPILE_TIME_ASSERT(sizeof(ak_fbx_u64) == 8);

typedef struct ak_fbx_s32_array {
    ak_fbx_s32* Ptr;
    ak_fbx_u32  Count;
} ak_fbx_s32_array;

typedef struct ak_fbx_string {
    const char* Str;
    ak_fbx_u32  Size;
} ak_fbx_string;

typedef struct ak_fbx_v2 {
    double Data[2];
} ak_fbx_v2;

typedef struct ak_fbx_v3 {
    double Data[3];
} ak_fbx_v3;

typedef struct ak_fbx_m4x3 {
    double Data[12];
} ak_fbx_m4x3;

typedef struct ak_fbx_v2_array {
    ak_fbx_v2* Ptr;
    ak_fbx_u32 Count;
} ak_fbx_v2_array;

typedef struct ak_fbx_v3_array {
    ak_fbx_v3* Ptr;
    ak_fbx_u32 Count;
} ak_fbx_v3_array;

typedef struct ak_fbx_polygon {
    ak_fbx_u32 IndexArrayOffset;
    ak_fbx_u32 IndexArrayCount;
} ak_fbx_polygon;

typedef struct ak_fbx_polygon_array {
    ak_fbx_polygon* Ptr;
    ak_fbx_u32      Count;
} ak_fbx_polygon_array;

typedef struct ak_fbx_polygons {
    ak_fbx_polygon_array PolygonArray;
    ak_fbx_s32_array     VertexIndices;
    ak_fbx_s32_array     NormalIndices;
